In [30]:
# Linear algebra 
import pandas as pd 

# Data processing 
import numpy as np 

# Decision tree
import xgboost as xgb

# Hyperparameter optimalization
import optuna as opt 

#Algorithms
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.metrics import f1_score, confusion_matrix, ConfusionMatrixDisplay
from sklearn.model_selection import RandomizedSearchCV, GridSearchCV
from sklearn.metrics import mean_squared_error
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv("/Users/tintun/Documents/GitHub/Oblig-2/data/train_data.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age
0,329,1,3,0,1,1,346,20.525,-1,2,31.0
1,74,0,3,1,1,0,166,14.4542,-1,0,26.0
2,254,0,3,1,1,0,419,16.1,-1,2,30.0
3,720,0,3,1,0,0,260,7.775,-1,2,33.0
4,667,0,2,1,0,0,104,13.0,-1,2,25.0

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Cabin,Embarked,Age
count,1493.000000,1493.000000,1493.000000,1493.000000,1493.000000,1493.000000,1493.000000,1493.000000,1.488000e+03
mean,597.697254,0.327528,2.261219,0.690556,0.184863,0.178835,5.994642,1.834561,2.151174e+05
std,251.365652,0.469469,0.628908,0.462419,0.594308,0.592203,24.214966,0.538178,8.295612e+06
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,-1.000000,-1.000000,-3.200000e+04
25%,377.000000,0.000000,2.000000,0.000000,0.000000,0.000000,-1.000000,2.000000,-3.500000e+01
50%,758.000000,0.000000,2.000000,1.000000,0.000000,0.000000,-1.000000,2.000000,1.600000e+01
75%,813.000000,1.000000,3.000000,1.000000,0.000000,0.000000,-1.000000,2.000000,2.400000e+01
max,891.000000,1.000000,3.000000,1.000000,5.000000,6.000000,133.000000,2.000000,3.200000e+08

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1493 entries, 0 to 1492
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1493 non-null   int64
 1   Survived     1493 non-null   int64
 2   Pclass       1493 non-null   int64
 3   Sex          1493 non-null   int64
 4   SibSp        1493 non-null   int64
 5   Parch        1493 non-null   int64
 6   Ticket       1493 non-null   object
 7   Fare         1493 non-null   object
 8   Cabin        1493 non-null   int64
 9   Embarked     1493 non-null   int64
 10  Age          1488 non-null   float64
dtypes: float64(1), int64(8), object(2)
memory usage: 128.4+ KB

# Data cleaning

In [8]:
# Removing NaN-values

df = df.dropna()

In [9]:

df.describe()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Cabin,Embarked,Age
count,1488.000000,1488.000000,1488.000000,1488.000000,1488.000000,1488.000000,1488.000000,1488.000000,1.488000e+03
mean,598.294355,0.325941,2.261425,0.692204,0.184812,0.179435,5.932124,1.836694,2.151174e+05
std,251.112938,0.468883,0.627388,0.461737,0.594854,0.593107,24.141426,0.534811,8.295612e+06
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,-1.000000,-1.000000,-3.200000e+04
25%,377.000000,0.000000,2.000000,0.000000,0.000000,0.000000,-1.000000,2.000000,-3.500000e+01
50%,759.500000,0.000000,2.000000,1.000000,0.000000,0.000000,-1.000000,2.000000,1.600000e+01
75%,813.000000,1.000000,3.000000,1.000000,0.000000,0.000000,-1.000000,2.000000,2.400000e+01
max,891.000000,1.000000,3.000000,1.000000,5.000000,6.000000,133.000000,2.000000,3.200000e+08

## Handle Outliers

In [11]:

df = df.drop_duplicates()

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 567 entries, 0 to 1492
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  567 non-null    int64
 1   Survived     567 non-null    int64
 2   Pclass       567 non-null    int64
 3   Sex          567 non-null    int64
 4   SibSp        567 non-null    int64
 5   Parch        567 non-null    int64
 6   Ticket       567 non-null    object
 7   Fare         567 non-null    object
 8   Cabin        567 non-null    int64
 9   Embarked     567 non-null    int64
 10  Age          567 non-null    float64
dtypes: float64(1), int64(8), object(2)
memory usage: 53.2+ KB

## Categorically Encoding "class"

In [35]:
df['Age'] = df['Age'].astype('category').cat.codes

## Model Creation

In [51]:
model = xgb.XGBRegressor()

In [52]:
X = df.drop("Age", axis=1)
y = df["Age"]

## Train test split

In [53]:
# The sklearn function train test split can be used to divide the data into train and test sets. employ test size=0.2 and random state=42. 
# We split the data into train and test sets using train test split. 
# In order to train the model and test it, we will require two sets of data: the train set and the test set. 
# For the purpose of assessing the model, we require a test set. If we use the entire dataset to train the model. 
# However, we won't be able to tell how well it performs with untried data because it will learn the dataset flawlessly.


X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

## Optuna hyperparameter optimalization